backend/artillery/runtime-test.yml
config:
  target: "https://grademeai-qabe.onrender.com"
  defaults:
    headers:
      Content-Type: "application/json"
      Origin: "https://grademeai-qafe.onrender.com"
  processor: "./processor.js"
  http:
    timeout: 30
    maxSockets: 5000
  environments:
    custom:
      phases:
        - duration: 5
          arrivalRate: 2
          maxVusers: 10
          name: "Chain Test: GradeMe AI Student Flow"

scenarios:
  - name: "GradeMe AI Student Flow"
    flow:
      - function: "assignUser"
      - post:
          name: "Student Login"
          url: "/api/auth/signin"
          headers:
            X-Forwarded-For: "{{ randomIP }}"
            Content-Type: "application/json"
          json:
            {
              "email": "{{ email }}",
              "password": "{{ password }}"
            }
          capture:
            - header: "set-cookie"
              as: "authCookie"
            - json: "$.access_token"
              as: "access_token"
            - json: "$.token"
              as: "token"
            - json: "$.jwt"
              as: "jwt"
            - json: "$.authorization"
              as: "authorization"
            - json: "$.user.token"
              as: "user_token"
            - json: "$.user.access_token"
              as: "user_access_token"
            - json: "$.user.id"
              as: "user.id"
            - json: "$.user.id"
              as: "user_id"
            - json: "$.user.id"
              as: "id"
            - json: "$.user.id"
              as: "studentId"
            - json: "$.user.id"
              as: "userId"
            - json: "$.user._id"
              as: "user._id"
            - json: "$.user._id"
              as: "user_id"
            - json: "$.user._id"
              as: "id"
            - json: "$.user._id"
              as: "studentId"
            - json: "$.id"
              as: "id"
            - json: "$.id"
              as: "user.id"
            - json: "$.id"
              as: "user_id"
            - json: "$._id"
              as: "id"
            - json: "$._id"
              as: "user_id"
            - json: "$.studentId"
              as: "studentId"
            - json: "$.studentId"
              as: "user.id"
            - json: "$.userId"
              as: "userId"
            - json: "$.userId"
              as: "user.id"
            - json: "$.user._id"
              as: "user__id"
          beforeRequest: "beforeStep"
          afterResponse: "logResponse"
      - think: 1
      - get:
          name: "Get Enrollments"
          url: "/api/enrollment/get-all/student/{{ id }}"
          headers:
            X-Forwarded-For: "{{ randomIP }}"
          capture:
            - header: "set-cookie"
              as: "authCookie"
            - json: "$.access_token"
              as: "access_token"
            - json: "$.token"
              as: "token"
            - json: "$.jwt"
              as: "jwt"
            - json: "$.authorization"
              as: "authorization"
            - json: "$.user.token"
              as: "user_token"
            - json: "$.user.access_token"
              as: "user_access_token"
            - json: "$.user.id"
              as: "user.id"
            - json: "$.user.id"
              as: "user_id"
            - json: "$.user.id"
              as: "id"
            - json: "$.user.id"
              as: "studentId"
            - json: "$.user.id"
              as: "userId"
            - json: "$.user._id"
              as: "user._id"
            - json: "$.user._id"
              as: "user_id"
            - json: "$.user._id"
              as: "id"
            - json: "$.user._id"
              as: "studentId"
            - json: "$.id"
              as: "id"
            - json: "$.id"
              as: "user.id"
            - json: "$.id"
              as: "user_id"
            - json: "$._id"
              as: "id"
            - json: "$._id"
              as: "user_id"
            - json: "$.studentId"
              as: "studentId"
            - json: "$.studentId"
              as: "user.id"
            - json: "$.userId"
              as: "userId"
            - json: "$.userId"
              as: "user.id"
            - json: "$.classId"
              as: "classId"
            - json: "$.enrollmentId"
              as: "enrollmentId"
          beforeRequest: "beforeStep"
          afterResponse: "logResponse"
      - think: 1